public class Main {
    public static void main(String[] args) {
//        Задание 3
//        В некоторых гос. структурах многих стран есть возможность вбить номер паспорта и получить информацию о том,
//        кому он принадлежит.
//        Напишите программу, которая содержит в себе упрощенный функционал этой системы.
//                Создайте класс Passport, содержащий в себе поля:
//«Номер паспорта» (уникальное, неповторяющееся значение);
//«Фамилия»;
//«Имя»;
//«Отчество» (если имеется; может быть пустым);
//«Дата рождения».
//        Выберите структуру данных, подходящую для хранения и получения (по номеру паспорта) объектов класса Passport.
//        Реализуйте 2 метода://
//        -Принимает объект класса Passport и сохраняет его в коллекцию. В случае если в коллекции уже есть паспорт
//        с данным номером, необходимо обновить остальные поля класса (фамилию, имя и т. д.)
//       - Принимает номер паспорта, ищет в коллекции объект с данным номером и возвращает весь объект.
//        Если объект не найден, возвращает null.

       ;
    }
}